Revit 2024 API
ExternalDataInstanceAddingIntoDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceAddingInto event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ExternalDataInstanceAddingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class ExternalDataInstanceAddingIntoDocumentEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class ExternalDataInstanceAddingIntoDocumentEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace